000100151207     D**********************************************************************
000200151207     D*                                                                   **
000300151207     D*    Definition specification:                                      **
000400151207     D*                                                                   **
000500151207     D**********************************************************************
000600151207
000700151207     D BeorRec       E Ds                  ExtName( Be_Beor )
