000100011019      **********************************************************************
000200160619      * Prototypes m.m. för gränssnitt till CS90001R
000300080318      **********************************************************************
000400160619     DDate2Num         PR             8S 0
000500160619     D DateFld                         D   value
000600160619
000700160619     DDate2CHAR        PR             8A
000800160619     D DateFld                         D   value
000900081024      ** Gränssnittsvariabler
