000100011019      **********************************************************************
000200160619      * Prototypes m.m. för gränssnitt till CS90001R
000300080318      **********************************************************************
000400161215     DVerList          PR
000500161215     D Date                           8S 0 const
000501161215     D rtnCount                      10I 0
000502161215     D rtnList                             LIKEDS(OutPutRow) DIM(9999)
000600160619
