000100000000
000200170118
000300170330       CTL-OPT option(*nodebugio) debug(*yes);
000400170118
000500170330       /INCLUDE QRPGLESRC,UPDTST01P
000600170118
000700170330       DCL-S  lib  CHAR(10);
000800170330       DCL-S  file CHAR(10);
000900170330       DCL-S  state CHAR(10);
001000170313
001100170313
001200170330       lib = 'SFBIODEV ';
001300170330       file = 'SALONG';
001400170330       state = '*DISABLED';
001500170330
001600170330       changeCstStatus(lib:file:state);
001700170330
001800170118       *Inlr = *ON ;
