000100011019      **********************************************************************
000200170330      * Prototypes m.m. för gränssnitt till UPDTST01R
000300080318      **********************************************************************
000400170330         DCL-PR changeCstStatus IND;
000500170330           lib     CHAR(10);
000600170330           file    CHAR(10);
000700170330           state   CHAR(10);
000800170330         END-PR;
000900170330
